---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyUInt64
source: html/11027d39-8825-f217-168d-981bff2a916f.htm
---
# AssetPropertyUInt64 Methods

Adds a new connected asset attached to this asset property, if it allows it.